In [1]:
# Import the sqlite3 module
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')

## CREATE TABLE, INSERT INTO, PRIMARY KEY, DATA TYPES (INT, VARCHAR)

In [2]:
# Create a table named 'students'
conn.execute('''CREATE TABLE students (
                id INT PRIMARY KEY,
                name VARCHAR(50),
                age INT,
                grade VARCHAR(2)
                )''')

# Insert some sample data into 'students'
conn.executemany('''INSERT INTO students (id, name, age, grade) VALUES (?, ?, ?, ?)''', [
                (1, 'Alice', 20, 'A'),
                (2, 'Bob', 22, 'B'),
                (3, 'Charlie', 21, 'C'),
                (4, 'David', 23, 'B')
                ])

In [3]:
# Create a table named 'courses'
conn.execute('''CREATE TABLE courses (
                id INT PRIMARY KEY,
                course_name VARCHAR(50),
                instructor VARCHAR(50)
                )''')

# Insert some sample data into 'courses'
conn.executemany('''INSERT INTO courses (id, course_name, instructor) VALUES (?, ?, ?)''', [
                (101, 'Mathematics', 'Dr. Smith'),
                (102, 'Physics', 'Prof. Johnson'),
                (103, 'Biology', 'Dr. Brown')
                ])

## SELECT

In [4]:
# Select all students
cursor = conn.execute('''SELECT * FROM students''')
print("All students:")
for row in cursor:
    print(row)

All students:
(1, 'Alice', 20, 'A')
(2, 'Bob', 22, 'B')
(3, 'Charlie', 21, 'C')
(4, 'David', 23, 'B')

## WHERE

In [5]:
# Select students aged 20 or older
cursor = conn.execute('''SELECT * FROM students WHERE age >= 20''')
print("\nStudents aged 20 or older:")
for row in cursor:
    print(row)

Students aged 20 or older:
(1, 'Alice', 20, 'A')
(2, 'Bob', 22, 'B')
(3, 'Charlie', 21, 'C')
(4, 'David', 23, 'B')

In [6]:
# Select students in grade 'B'
cursor = conn.execute('''SELECT * FROM students WHERE grade = 'B' ''')
print("\nStudents in grade 'B':")
for row in cursor:
    print(row)

Students in grade 'B':
(2, 'Bob', 22, 'B')
(4, 'David', 23, 'B')

In [7]:
# Select courses taught by Dr. Brown
cursor = conn.execute('''SELECT * FROM courses WHERE instructor = 'Dr. Brown' ''')
print("\nCourses taught by Dr. Brown:")
for row in cursor:
    print(row)

Courses taught by Dr. Brown:
(103, 'Biology', 'Dr. Brown')

In [8]:
# Select students named 'Bob'
cursor = conn.execute('''SELECT * FROM students WHERE name = 'Bob' ''')
print("\nStudents named 'Bob':")
for row in cursor:
    print(row)

Students named 'Bob':
(2, 'Bob', 22, 'B')

## OR

In [9]:
# Select students younger than 22 or in grade 'A'
cursor = conn.execute('''SELECT * FROM students WHERE age < 22 OR grade = 'A' ''')
print("\nStudents younger than 22 or in grade 'A':")
for row in cursor:
    print(row)

Students younger than 22 or in grade 'A':
(1, 'Alice', 20, 'A')
(3, 'Charlie', 21, 'C')

## AND, BETWEEN, NOT

In [10]:
# Select students whose age is not between 20 and 22
cursor = conn.execute('''SELECT * FROM students WHERE age NOT BETWEEN 20 AND 22''')
print("\nStudents whose age is not between 20 and 22:")
for row in cursor:
    print(row)

Students whose age is not between 20 and 22:
(4, 'David', 23, 'B')

## IN

In [11]:
# Select students in grade 'A' or 'B'
cursor = conn.execute('''SELECT * FROM students WHERE grade IN ('A', 'B')''')
print("\nStudents in grade 'A' or 'B':")
for row in cursor:
    print(row)

Students in grade 'A' or 'B':
(1, 'Alice', 20, 'A')
(2, 'Bob', 22, 'B')
(4, 'David', 23, 'B')

## LIKE

In [12]:
# Select courses with names containing 'Phys'
cursor = conn.execute('''SELECT * FROM courses WHERE course_name LIKE '%Phys%' ''')
print("\nCourses with names containing 'Phys':")
for row in cursor:
    print(row)

Courses with names containing 'Phys':
(102, 'Physics', 'Prof. Johnson')

In [13]:
# Select students with names starting with 'A'
cursor = conn.execute('''SELECT * FROM students WHERE name LIKE 'A%' ''')
print("\nStudents with names starting with 'A':")
for row in cursor:
    print(row)

Students with names starting with 'A':
(1, 'Alice', 20, 'A')

In [14]:
# Select students with names containing 'a' (case-insensitive)
cursor = conn.execute('''SELECT * FROM students WHERE name LIKE '%a%' COLLATE NOCASE''') 
print("\nStudents with names containing 'a' (case-insensitive):")
for row in cursor:
    print(row)
    
## '%a%' matches any string containing 'a' anywhere in the name
## 'a%' matches any string starting with 'a'
## COLLATE NOCASE ensures case insensetive comparison

Students with names containing 'a' (case-insensitive):
(1, 'Alice', 20, 'A')
(3, 'Charlie', 21, 'C')
(4, 'David', 23, 'B')

## DISTINCT

In [15]:
# Select distinct grades
cursor = conn.execute('''SELECT DISTINCT grade FROM students''')
print("\nDistinct grades:")
for row in cursor:
    print(row[0])

Distinct grades:
A
B
C

## COUNT

In [16]:
# Count the number of students
cursor = conn.execute('''SELECT COUNT(*) FROM students''')
num_students = cursor.fetchone()[0]
print("\nNumber of students:", num_students)

Number of students: 4

In [17]:
# Count the number of distinct instructors
cursor = conn.execute('''SELECT COUNT(DISTINCT instructor) FROM courses''')
num_instructors = cursor.fetchone()[0]
print("\nNumber of distinct instructors:", num_instructors)

Number of distinct instructors: 3

## ISNULL

In [18]:
# Select courses with no instructor assigned
cursor = conn.execute('''SELECT * FROM courses WHERE instructor IS NULL''')
print("\nCourses with no instructor assigned:")
for row in cursor:
    print(row)

Courses with no instructor assigned:

## AVERAGE AVG

In [19]:
# Calculate the average age of students
cursor = conn.execute('''SELECT AVG(age) AS average_age FROM students''')
average_age = cursor.fetchone()[0]
print("\nAverage age of students:", average_age)

Average age of students: 21.5

## GROUP BY

In [20]:
# Find the number of students per grade
cursor = conn.execute('''SELECT grade, COUNT(*) AS num_students FROM students GROUP BY grade''')
print("\nNumber of students per grade:")
for row in cursor:
    print(row)

Number of students per grade:
('A', 1)
('B', 2)
('C', 1)

In [21]:
# Select the average age of students in each grade
cursor = conn.execute('''SELECT grade, AVG(age) AS average_age FROM students GROUP BY grade''')
print("\nAverage age of students in each grade:")
for row in cursor:
    print(row)

Average age of students in each grade:
('A', 20.0)
('B', 22.5)
('C', 21.0)

In [22]:
# Count the number of distinct instructors and print their names
cursor = conn.execute('''SELECT COUNT(DISTINCT instructor), instructor FROM courses GROUP BY instructor''')
print("\nNumber of distinct instructors and their names:")
for row in cursor:
    print("Instructor:", row[1], " - Count:", row[0])

Number of distinct instructors and their names:
Instructor: Dr. Brown  - Count: 1
Instructor: Dr. Smith  - Count: 1
Instructor: Prof. Johnson  - Count: 1

## UPDATE

In [23]:
# Update Alice's grade to 'A+'
conn.execute('''UPDATE students SET grade = 'A+' WHERE name = 'Alice' ''')

## DELETE

In [24]:
# Delete David's record
conn.execute('''DELETE FROM students WHERE name = 'David' ''')

## ORDER BY, DESC, LIMIT

In [25]:
# Select students sorted by name in descending order
cursor = conn.execute('''SELECT * FROM students ORDER BY name DESC''')
print("\nStudents sorted by name in descending order:")
for row in cursor:
    print(row)

Students sorted by name in descending order:
(3, 'Charlie', 21, 'C')
(2, 'Bob', 22, 'B')
(1, 'Alice', 20, 'A+')

In [26]:
# Select the oldest student
cursor = conn.execute('''SELECT * FROM students ORDER BY age DESC LIMIT 1''')
print("\nThe oldest student:")
print(cursor.fetchone())

The oldest student:
(2, 'Bob', 22, 'B')

In [27]:
# Select the top 3 oldest students
cursor = conn.execute('''SELECT * FROM students ORDER BY age DESC LIMIT 3''')
print("\nThe top 3 oldest students:")
for row in cursor:
    print(row)

The top 3 oldest students:
(2, 'Bob', 22, 'B')
(3, 'Charlie', 21, 'C')
(1, 'Alice', 20, 'A+')

In [28]:
# Select the youngest student
cursor = conn.execute('''SELECT * FROM students ORDER BY age LIMIT 1''')
print("\nThe youngest student:")
print(cursor.fetchone())

The youngest student:
(1, 'Alice', 20, 'A+')

In [29]:
# Select the course with the longest name
cursor = conn.execute('''SELECT * FROM courses ORDER BY LENGTH(course_name) DESC LIMIT 1''')
print("\nThe course with the longest name:")
print(cursor.fetchone())

The course with the longest name:
(101, 'Mathematics', 'Dr. Smith')

In [30]:
#Select the instructor who teaches the most courses
cursor = conn.execute('''SELECT instructor, COUNT(*) AS num_courses 
                         FROM courses 
                         GROUP BY instructor 
                         ORDER BY COUNT(*) DESC 
                         LIMIT 1''')
most_courses_instructor = cursor.fetchone()
print("\nInstructor who teaches the most courses:", most_courses_instructor[0], "- Number of courses:", most_courses_instructor[1])

Instructor who teaches the most courses: Prof. Johnson - Number of courses: 1

In [31]:
# Select the grade with the most students
cursor = conn.execute('''SELECT grade, COUNT(*) AS num_students 
                         FROM students 
                         GROUP BY grade 
                         ORDER BY COUNT(*) DESC 
                         LIMIT 1''')
most_popular_grade = cursor.fetchone()
print("\nGrade with the most students:", most_popular_grade[0], "- Number of students:", most_popular_grade[1])

Grade with the most students: C - Number of students: 1

## INNER JOIN

In [32]:
# Select students and their courses (JOIN)
cursor = conn.execute('''SELECT students.name, students.grade, courses.course_name
                         FROM students
                         INNER JOIN courses ON students.id = courses.id''')
print("\nStudents and their courses:")
for row in cursor:
    print(row)

Students and their courses:

In [33]:
# Select all students and their courses
cursor = conn.execute('''SELECT students.name, students.grade, courses.course_name
                         FROM students, courses''')

# Fetch and print the results
print("Students and their courses:")
for row in cursor:
    print(row)

Students and their courses:
('Alice', 'A+', 'Mathematics')
('Alice', 'A+', 'Physics')
('Alice', 'A+', 'Biology')
('Bob', 'B', 'Mathematics')
('Bob', 'B', 'Physics')
('Bob', 'B', 'Biology')
('Charlie', 'C', 'Mathematics')
('Charlie', 'C', 'Physics')
('Charlie', 'C', 'Biology')

## LEFT JOIN

In [34]:
# Select courses and their instructors (LEFT JOIN)
cursor = conn.execute('''SELECT courses.course_name, courses.instructor, students.name
                         FROM courses
                         LEFT JOIN students ON courses.id = students.id''')
print("\nCourses and their instructors (LEFT JOIN):")
for row in cursor:
    print(row)

Courses and their instructors (LEFT JOIN):
('Mathematics', 'Dr. Smith', None)
('Physics', 'Prof. Johnson', None)
('Biology', 'Dr. Brown', None)

## UNION, UNION ALL

In [35]:
# Insert some sample data into 'courses' with duplicate entries for Dr. Smith
conn.executemany('''INSERT INTO courses (id, course_name, instructor) VALUES (?, ?, ?)''', [
                (104, 'Chemistry', 'Dr. Smith'),
                (105, 'Biology', 'Dr. Smith'),
                (106, 'Physics', 'Dr. Brown'),
                (107, 'Chemistry', 'Dr. Smith')  # Duplicate entry for Dr. Smith
                ])

In [36]:
# Select courses taught by Dr. Brown and Dr. Smith using UNION ALL
cursor = conn.execute('''SELECT course_name, instructor FROM courses WHERE instructor = 'Dr. Brown'
                        UNION ALL
                        SELECT course_name, instructor FROM courses WHERE instructor = 'Dr. Smith' ''')
print("\nCourses taught by Dr. Brown and Dr. Smith (using UNION ALL):")
for row in cursor:
    print(row)

Courses taught by Dr. Brown and Dr. Smith (using UNION ALL):
('Biology', 'Dr. Brown')
('Physics', 'Dr. Brown')
('Mathematics', 'Dr. Smith')
('Chemistry', 'Dr. Smith')
('Biology', 'Dr. Smith')
('Chemistry', 'Dr. Smith')

In [37]:
# Select courses taught by Dr. Brown and Dr. Smith using UNION
cursor = conn.execute('''SELECT course_name, instructor FROM courses WHERE instructor = 'Dr. Brown'
                        UNION
                        SELECT course_name, instructor FROM courses WHERE instructor = 'Dr. Smith' ''')
print("\nCourses taught by Dr. Brown and Dr. Smith (using UNION):")
for row in cursor:
    print(row)

Courses taught by Dr. Brown and Dr. Smith (using UNION):
('Biology', 'Dr. Brown')
('Biology', 'Dr. Smith')
('Chemistry', 'Dr. Smith')
('Mathematics', 'Dr. Smith')
('Physics', 'Dr. Brown')

In [38]:
# Close connection to the database
conn.close()